class AppStrings{
  static const String name = "سالم";
  static const String intro1Description = "مقياس احتمالية التعرض للإصابة بفايروس كورونا المستجد";
  static const String copyright = "جميع الحقوق محفوظه 2020";
  static const String introVideo = 'المبادئ العلمية \nوراء هذا التطبيق';
  static const String usingApp = 'كيف تستخدم التطبيق'; 
  static const String intro2Description = " هذا التطبيق يقوم بحساب احتماليات إصابتك بفايروس كوفيد ١٩ المستجد قبل دخولك الى اي مساحة فراغية مغلقه،  بناء على ملاحظاتك الشخصيه و اعتمادا على أنماط الإصابة المسجلة حول العالم";
  static const String intro3Description1 = "استخدام هذا التطبيق كأداة مساعدة لتفادي وجودك في اماكن خطرة.";
  static const String intro3Description2 = "لا يمكن بأي حال من الأحوال الاعتماد فقط على التطبيق لتفادي الإصابة.";
  static const String homeQ = "هل ترغب بالخروج من المنزل\n لقضاء بعض الأمور المهمة؟";
  static const String homeInfo = '" تذكر”\n\n يمكنك و انت في منزلك القيام بالأمور الاتية دون الحاجة الى الخروج من :المنزل \n\nالتحدث مع الاهل و - الأصدقاء عن طريق الهاتف او الاتصال .المرئي \n.التسوق عن بعد-   \n.العمل من المنزل- ';
  static const String homeQNo = "عدم مخالطتك الناس و التزامك بالبقاء في المنزل و عدم الخروج الا للضرورة يقيك و يقي الاخرين من خطر الإصابة بفايروس كورونا المستجد.";
  static const String homeQNoBeSafe = 'ابقى سالماً'; 
  static const String homeYesInfo = 'انا على وعي كامل بالمخاطر في الخارج المترتبة عن تفشي جائحة كورونا المستجدة';
  static const String homeYesConf = 'اتعهد بأخذ جميع الاحتياطات اللازمة لحماية نفسي و الاخرين';
  static const String spaceOpen = 'حيز مفتوح';
  static const String spaceClosed = 'حيز مغلق';
  static const String spaceQ = 'هل انت بصدد الدخول الى حيز فراغي مغلق ام مفتوح؟ ';
  static const String openSpaceDescription = 'خطر اصابتك في الأماكن المفتوحة جدا ضئيل اذا التزمت بالاتي';
  static const String openInfo = '- تجنب وجودك في أماكن يتجمع فيها اكثر من 5 اشخاص بلا \n\n.مسافات امنة ارتدي اللثام الواقي - \n\n.الطبي حافظ على مسافة 2 -  متر او اكثر بينك و بين \n\n.من هم حولك تجنب لمسك اغشية - .العين او الانف او الفم';
  static const String closedSpaceDis = 'خطر اصابتك في الأماكن المغلقة عالي نسبياً في وجود غرباء و احتمالية حمل احدهم الفايروس بلا اعراض واضحه';
  static const String closedSpaceConf = 'استكشف احتمالية اصابتك في المساحات المغلقة';
  static const String closedInfo = '"احذر"\n\n اثبتت الأبحاث العلمية و البيانات الرقمية من حول العالم ان فيروس كورونا المستجد ينتقل بشكل أساسي عن طريق تلوث الهواء بالفيروس و عن طريق تلوث الاسطح\n وجودك في حيز فراغي مغلق او شبه مغلق ذو تهويه ضعيفة و بلا وسائل حماية صحيحه, يعرضك لخطر الإصابة بالفايروس';
  static const String sizedQ = 'صف حجم الحيز الفراغي الذي تعتزم الدخول اليه';
  static const String box20M = 'حيز فراغي هائل\n قاعة فعاليات هائلة، هايبير ماركيت، مصنع';
  static const String box12M = 'حيز فراغي كبير\n قاعة اجتماعات كبيرة، قاعة فعاليات، محل كبير';
  static const String box8M = 'حيز فراغي متوسط\n غرفة متوسطة, مكتب متوسط قاعة اجتماعات, محل متوسط';
  static const String box4M = 'حيز فراغي صغير\n غرفة صغيرة, مكتب صغير محل صغير, دورة مياه, سيارة';
  static const String sizeInfo = '"تفكر"\n\n تركيز قطرة حبر في كوب ماء صغير اكبر من';
  static const String sizeInfo2 = 'تركيز قطرة حبر في حمام سباحة أوليمبي';
  static const String heightQ = 'صف ارتفاع الحيز الفراغي الذي تعتزم الدخول اليه';
  static const String acQ = 'صف نوعية نظام التكييف او تحريك الهواء في هذا الحيز الفراغي ';
  static const String wallAC = 'لا توجد في مكيفات الحائط مرشحات فعاله ضد الفيروسات\n\n ينصح بضبط المكيف على وضع "ادخال الهواء الخارجي" لتجديد الهواء بانتظام';
  static const String cAC = 'مرشحات الهواء في هذه الأنظمة غير فعاله ضد الفيروسات قد تكون مصدر لإعادة نشر الفيروسات داخل الحيز الفراغي ولا يمكن  لهذه الأنواع  تجديد الهواء الداخلي';
  static const String bAC = 'اغلبية المكيفات المركزية تقوم بتجديد الهواء  الداخلي بهواء خارجي بشكل دوري و بعضها يحتوي على مرشحات مضادة للفيروسات';
  static const String fan = 'مراوح السقف لا تقوم باي فلترة للهواء';
  static const String noAir = 'عدم وجود أي نظام لتحريك الهواء في الحيز الفراغي, يعرضك لخطر الإصابة بشكل كبير جدا'; 
  static const String window = 'هل توجد نوافذ او أبواب مفتوحه على مدار الساعة او أبواب الية تسمح بتجدد الهواء في هذا الحيز الفراغي ؟';
  static const String filterQ = 'هل توجد أجهزة تنقية هواء متخصصه في هذا الحيز الفراغي؟';
  static const String peopleQ = 'كم هو عدد الأشخاص المتواجدون في هذا الحيز الفراغي؟';
  static const String maskQ = 'هل اغلبية الأشخاص داخل هذا الحيز الفراغي يرتدون اللثام الواقي الطبي؟'; 
  static const String confMaskQ = 'هل ستلتزم بارتداء اللثام الواقي الطبي في هذا الحيز الفراغي؟';
  static const String safeSpace = 'هل ستلتزم بوضع مسافة امان لا تقل عن 2 متر عن ممن هم حولك؟';
  static const String touchQ = 'هل ستلتزم بعدم لمس عينيك او انفك او فمك اثناء تواجدك في هذا الحيز الفراغي؟';
  static const String resultIntro = 'احتمالية اصابتك بفايروس كورونا\n المستجد في هذه المساحة\n الفراغية هي:';
  // static const String resultInfo = 'ينصح بالبقاء في هذا الحيز الفراغي لمدة:';
  static const String resultInfo = 'ينصح بالبقاء في هذا الحيز الفراغي لمدة لا تتعدى:';
  static const String airQ1 = 'جدد هواء الحيز الفراغي المغلق بشكل مستمر بالحرص على وجود تيار هوائي متحرك من و الى خارج الحيز الفراغي يمكن تحقيق هذا بفتح النوافذ و الأبواب للهواء الخارجي';
  static const String airQ2 = 'تخفيض عدد الأشخاص داخل الحيز الفراغي ';
  // static const String airQ3 = 'راء فلاتر تصفية الهواء بنظام متوفرة في اغلب محلات HEPA بيع المعدات الكهربائية الكبرى في السلطنة';
  static const String airQ3 = """ شراء فلاتر تصفية الهواء بنظام
متوفرة في اغلب محلات HEPA
بيع المعدات الكهربائية الكبرى
في السلطنة""";
  // static const String airQ4 = 'برمجة نظام التكيفي للحيز الفراغي بحيث يقوم بتجديد الهواء الداخلي بهواء .خارجي اذا توفرت هذه ';
  static const String airQ4 = """  برمجة نظام التكيفي للحيز الفراغي
 بحيث يقوم بتجديد الهواء الداخلي بهواء
خارجي اذا توفرت هذه الخاصية""";
}